apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c129_gpio.h
#define GPIO_IM_DMAIME              (1 << 8)  /* Bit 8: GPIO μDMA Done Interrupt Mask Enable */

/* GPIO Raw Interrupt Status */

#define GPIO_RIS_DMARIS             (1 << 8)  /* Bit 8: GPIO μDMA Done Interrupt Raw Status */

/* GPIO Masked Interrupt Status */

#define GPIO_MIS_DMAMIS             (1 << 8)  /* Bit 8: GPIO μDMA Done Masked Interrupt Status */

/* GPIO Interrupt Clear */

#define GPIO_ICR_DMAIC              (1 << 8)  /* Bit 8: GPIO μDMA Interrupt Clear */

/* GPIO Lock */

#define GPIO_LOCK_UNLOCK            0x4c4f434b
#define GPIO_LOCK_LOCKED            (1 << 0)  /* Bit 0: GPIOCR register is locked */

/* GPIO Port Control */

#define GPIO_PCTL_PMC_SHIFT(n)      ((n) << 2)
#define GPIO_PCTL_PMC_MASK(n)       (15 << GPIO_PCTL_PMC_SHIFT(n))

#define GPIO_PCTL_PMC0_SHIFT        (0)     /* Bits 0-3: Port Mux Control 0 */
#define GPIO_PCTL_PMC0_MASK         (15 << GPIO_PCTL_PMC0_SHIFT)
#define GPIO_PCTL_PMC1_SHIFT        (4)     /* Bits 4-7: Port Mux Control 1 */
#define GPIO_PCTL_PMC1_MASK         (15 << GPIO_PCTL_PMC1_SHIFT)
#define GPIO_PCTL_PMC2_SHIFT        (8)     /* Bits 8-11: Port Mux Control 2 */
#define GPIO_PCTL_PMC2_MASK         (15 << GPIO_PCTL_PMC2_SHIFT)
#define GPIO_PCTL_PMC3_SHIFT        (12)    /* Bits 12-15: Port Mux Control 3 */
#define GPIO_PCTL_PMC3_MASK         (15 << GPIO_PCTL_PMC3_SHIFT)
#define GPIO_PCTL_PMC4_SHIFT        (16)    /* Bits 16-19: Port Mux Control 4 */
#define GPIO_PCTL_PMC4_MASK         (15 << GPIO_PCTL_PMC4_SHIFT)
#define GPIO_PCTL_PMC5_SHIFT        (20)    /* Bits 20-23: Port Mux Control 5 */
#define GPIO_PCTL_PMC5_MASK         (15 << GPIO_PCTL_PMC5_SHIFT)
#define GPIO_PCTL_PMC6_SHIFT        (24)    /* Bits 24-27: Port Mux Control 6 */
#define GPIO_PCTL_PMC6_MASK         (15 << GPIO_PCTL_PMC6_SHIFT)
#define GPIO_PCTL_PMC7_SHIFT        (28)    /* Bits 28-31: Port Mux Control 7 */
#define GPIO_PCTL_PMC7_MASK         (15 << GPIO_PCTL_PMC7_SHIFT)

/* GPIO Select Interrupt */

#define GPIO_SI_SUM                 (1 << 0)  /* Bit 0:  Summary Interrupt */

/* GPIO Peripheral Property */

#define GPIO_PP_EDE                 (1 << 0)  /* Bit 0:  Extended Drive Enable */

/* GPIO Peripheral Configuration */

#define GPIO_PC_EDM_SHIFT(n)        ((n) << 1)
#define GPIO_PC_EDM_MASK(n)         (3 << GPIO_PC_EDM_SHIFT(n))

#define GPIO_PC_EDM0_SHIFT          (0)     /* Bits 0-1: Extended Drive Mode Bit 0 */
#define GPIO_PC_EDM0_MASK           (3 << GPIO_PC_EDM0_SHIFT)
#define GPIO_PC_EDM1_SHIFT          (2)     /* Bits 2-3: Extended Drive Mode Bit 1 */
#define GPIO_PC_EDM1_MASK           (3 << GPIO_PC_EDM1_SHIFT)
#define GPIO_PC_EDM2_SHIFT          (4)     /* Bits 4-5: Extended Drive Mode Bit 2 */
#define GPIO_PC_EDM2_MASK           (3 << GPIO_PC_EDM2_SHIFT)
#define GPIO_PC_EDM3_SHIFT          (6)     /* Bits 6-7: Extended Drive Mode Bit 3 */
#define GPIO_PC_EDM3_MASK           (3 << GPIO_PC_EDM3_SHIFT)
#define GPIO_PC_EDM4_SHIFT          (8)     /* Bits 8-9: Extended Drive Mode Bit 4 */
#define GPIO_PC_EDM4_MASK           (3 << GPIO_PC_EDM4_SHIFT)
#define GPIO_PC_EDM5_SHIFT          (10)    /* Bits 10-11: Extended Drive Mode Bit 5 */
#define GPIO_PC_EDM5_MASK           (3 << GPIO_PC_EDM5_SHIFT)
#define GPIO_PC_EDM6_SHIFT          (12)    /* Bits 12-13: Extended Drive Mode Bit 6 */
#define GPIO_PC_EDM6_MASK           (3 << GPIO_PC_EDM6_SHIFT)
#define GPIO_PC_EDM7_SHIFT          (14)    /* Bits 14-15: Extended Drive Mode Bit 7 */
#define GPIO_PC_EDM7_MASK           (3 << GPIO_PC_EDM7_SHIFT)

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Function Prototypes
 ************************************************************************************/

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C129_GPIO_H */
